app/views/books/_form.html.erb

SELECT "categories".* FROM "categories"
---
    <%= form.label :category %><br>
    <%= form.collection_select :category_id, Category.all, :id, :name %>