app/controllers/books_controller.rb

  def create
    @book = Book.new(book_params)

    respond_to do |format|
      if @book.save
---
INSERT INTO "books" ("name", "author", "copy_count", "category_code", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Concepts of Physics"], ["author", "H C Verma"], ["copy_count", 7], ["category_code", "PHY1"], ["created_at", "2021-08-24 07:15:23.969045"], ["updated_at", "2021-08-24 07:15:23.969045"]]

  def update
    respond_to do |format|
      if @book.update(book_params)
---
UPDATE "books" SET "category_code" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["category_code", "MATH"], ["updated_at", "2021-08-25 09:56:18.046671"], ["id", 6]]